// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

const min = Math.floor(Math.random() * (59 - 0) + 0);

if (0 <= min && min <= 15) {
    alert(`${min} входить в першу чверть`);
    } else if (16 < min && min<= 30) {
    alert(`${min} входить в другу чверть`);
    } else if (30 < min && min<= 45) {
    alert(`${min} входить в третю чверть`);
    }  else if (45 < min && min <= 59) {
    alert(`${min} входить в четверту чверть`);
    } else {
        alert( `Невірне число`)
};

