// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).


function isAdult(age) {
    if (age >= 18) {
        return true;
    } else {
        return !confirm('Ви впевнені?');
        // чи треба тут знак оклику
    }
}

console.log(isAdult(13));
console.log(isAdult(25));
console.log(isAdult(18));

// спитати у викладача стосовно функції confirmed бо коли ми підтверджуємо що нам дійсно менше 18 років нам повертається TRUE а мені здається нам потрібно щоб поверталась False